<?php
// Задание 1 __________________________________________________________________________
$i = 0;
while ($i <= 100)
{
    echo $i % 3 == 0 ? $i . '<br>' . PHP_EOL : null;
    $i++;
}

// Задание 2 __________________________________________________________________________
$y = 0;
do {
    if ($y == 0) {
        echo "{$y} - ноль.<br>" . PHP_EOL;
    }
    else {
        echo $y % 2 == 0 ? "{$y} - чётное число.<br>" . PHP_EOL : "{$y} - нечётное число.<br>" . PHP_EOL;
    }
    $y++;
} while ($y <= 10);

// Задание 3 __________________________________________________________________________
$arr = [
    "Московская область" => [
        "Москва", "Зеленоград", "Клин"
    ],
    "Ленинградская область" => [
        "Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"
    ],
    "Рязанская область" => [
        "Сасово", "Чучково", "Сараи", "Сапожок"
    ]
];
foreach ($arr as $region => $townArr) {
    echo "{$region}:<br>" . PHP_EOL;
    foreach ($townArr as $town) {
        echo $town;
        // если элемент является последним в массиве городов, то ставим точку + перенос строки
        echo array_search($town, $townArr) == count($townArr) - 1 ? ".<br>" . PHP_EOL : ", ";
    }
}

// Задание 4 __________________________________________________________________________
$translitor = [ // не translAtor, а именно транслИттер :)
    'а' => 'a',   'б' => 'b',   'в' => 'v',
    'г' => 'g',   'д' => 'd',   'е' => 'e',
    'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
    'и' => 'i',   'й' => 'y',   'к' => 'k',
    'л' => 'l',   'м' => 'm',   'н' => 'n',
    'о' => 'o',   'п' => 'p',   'р' => 'r',
    'с' => 's',   'т' => 't',   'у' => 'u',
    'ф' => 'f',   'х' => 'h',   'ц' => 'c',
    'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
    'ь' => '\'',  'ы' => 'y',   'ъ' => '\'',
    'э' => 'e',   'ю' => 'yu',  'я' => 'ya'
    ];
    $text = "Я пришёл к тебе с приветом рассказать, что солнце встало!";
    
function translite ($string, $rules) {
    $translitted = '';
    foreach (mb_str_split($string) as $letter) {
        // проверка является ли буква одним из основных символов
        if ($letter == ' ' || $letter == ',' || $letter == '.' || $letter == '!' || $letter == '?' || $letter == ':' || $letter == ';') {
            $translitted .= $letter;
        }
        // проверка является ли буква заглавной. если является - делаем соответствующие действия
        // пробовал ctype_upper - оно было бы грамотнее, но так не работает с русскими буквами
        elseif (mb_strtoupper($letter) === $letter) {
            $letter = mb_strtolower($letter);
            $translitted .= mb_strtoupper($rules[$letter]);
        }
        // если буква прошла все проверки - просто переводим её
        else {
            $translitted .= $rules[$letter];
        }
    }
    return $translitted;
}
echo translite($text, $translitor);

// Задание 5 __________________________________________________________________________
$defaultString = "Пробелов больше не будет. Пробелы приняли Ислам.";
function spaceToUnderline ($str) {
        return str_replace(" ", "_", $str);
    }
echo spaceToUnderline($defaultString);
    
// Задание 7 __________________________________________________________________________
for ($x = 0; $x < 10; print($x++)) {}

// Задание 8 __________________________________________________________________________
$arr = [
    "Московская область" => [
        "Ктест", "Москва", "Зеленоград", "Клин"
    ],
    "Ленинградская область" => [
        "Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт", "Кгород"
    ],
    "Рязанская область" => [
        "Сасово", "Чучково", "Сараи", "Сапожок"
    ]
];
foreach ($arr as $region => $townArr) {
    echo "<hr>{$region}:<br>" . PHP_EOL;
    $kFound = 0;
    foreach ($townArr as $town) {
        if (mb_substr($town, 0, 1) == "К") {
            $kFound++;
            echo $town;
            // если элемент является последним в массиве городов, то ставим точку + перенос строки
            echo array_search($town, $townArr) == count($townArr) - 1 ? ".<br>" . PHP_EOL : ", ";
        }
    }
    echo $kFound > 0 ? '' : "{$region} не содержит городов на 'К'<br>" . PHP_EOL;
}

// Задание 9 __________________________________________________________________________
$translitor2 = [
    'а' => 'a',   'б' => 'b',   'в' => 'v',
    'г' => 'g',   'д' => 'd',   'е' => 'e',
    'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
    'и' => 'i',   'й' => 'y',   'к' => 'k',
    'л' => 'l',   'м' => 'm',   'н' => 'n',
    'о' => 'o',   'п' => 'p',   'р' => 'r',
    'с' => 's',   'т' => 't',   'у' => 'u',
    'ф' => 'f',   'х' => 'h',   'ц' => 'c',
    'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
    'ь' => '\'',  'ы' => 'y',   'ъ' => '\'',
    'э' => 'e',   'ю' => 'yu',  'я' => 'ya',
    ' ' => '_'
    ];
    
/* 
    Так как это задание на практику форматирования url-адресов, я немного изменил логику:
    теперь в выдаваемой строке не будет никаких символов (кроме _) и заглавных букв.
    Смену пробела на "_" я прописал как в коде (чтобы вы видели, что я не "схалтурил") - 
    он там закомментирован, но проверен и работоспособен, так и в самом словаре 
    (если это реальный скрипт, сменяющий адрес сайта на валидный,
    то в массиве априоре будут учитываться все нужные символы - это заметно сократит код)
*/

function translite2 ($string, $rules) {
    $translitted = '';
    foreach (mb_str_split($string) as $letter) {
        // if ($letter == " ") $translitted .= '_';
        // else {
            $letter = mb_strtolower($letter);
            $translitted .= $rules[$letter];
        // }
    }
    return str_replace("__", "_", $translitted);
}

$text2 = "Главная - Обо мне - Контакты";
echo translite2($text2, $translitor2);